title: Possible DLL Side-Loading Using DlpUserAgent.exe
id: 26a153b1-e5e8-4288-b1d1-d4ed6fc1c596
status: experimental
description: |
  Detects DlpUserAgent.exe (Microsoft Defender Data Loss Prevention User Agent)
  running from an unusual or unknown directory, which may be indicative of DLL
  Side-Loading. This binary legitimately resides within the Windows Defender
  directory and has been observed being abused by threat actors to sideload
  malicious DLLs delivering C2 payloads such as Havoc.
author: Matt Anderson (Huntress)
references:
  - https://attack.mitre.org/techniques/T1574/002/
date: 2026/02/27
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    OriginalFileName: 'DlpUserAgent.exe'
  filter_legit:
    Image|contains: '\Windows Defender\'
  condition: selection and not filter_legit
falsepositives:
  - Unknown
level: high
tags:
  - attack.defense_evasion
  - attack.t1574.002
