title: Possible DLL Side-Loading Using ADNotificationManager.exe
id: ed26d612-bb1b-46d1-92f5-c7d51dc81080
status: experimental
description: |
  Detects ADNotificationManager.exe (Adobe Notification Manager) running from an
  unusual or unknown directory, which may be indicative of DLL Side-Loading.
  This binary has been observed being abused by multiple threat actors including
  GOLD BLADE to sideload malicious DLLs and deliver C2 payloads such as Havoc.
author: Matt Anderson (Huntress)
references:
  - https://news.sophos.com/en-us/2025/07/29/gold-blade-remote-dll-sideloading-attack-deploys-redloader/
date: 2026/02/27
logsource:
  category: process_creation
  product: windows
detection:
  selection_name:
    OriginalFileName: 'ADNotificationManager.exe'
    Image|endswith: '\ADNotificationManager.exe'
  filter_legit:
    Image|contains:
      - '\Acrobat'
      - '\Reader'
  condition: selection_name and not filter_legit
falsepositives:
  - Legitimate usage of ADNotificationManager.exe installed in custom directories
level: high
tags:
  - attack.defense_evasion
  - attack.t1574.002
